Mahmoud976/PIC18F_Full_drivers/project 1/MCAL/GPIO/gpio.h
/* 
 * File:   gpio.h
 * Author: mahmo
 *
 * Created on January 16, 2023, 6:19 PM
 */

#ifndef GPIO_H
#define	GPIO_H
/*  Section : Includes  */
#include"pic18f4620.h"
#include"../std_types.h"
#include"../DEVICE_CONFIG.h"
#include"gpio_config.h"
/*  Section : Macro Declarations  */
#define PORTC_MASK  0xFF
#define BIT_MASK   (uint8_t)1 
#define MAX_PIN_NUMBER 8
#define MAX_PORT_NUMBER 5
#define MAX_DIRECTION_NUMBER 2
#define MAX_LOGIC_NUMBER 2
#define GPIO_PORT_PIN_CONFIGURATION CONFIG_ENABLE
#define GPIO_PORT_CONFIGURATION CONFIG_ENABLE
/*  Section : Function Macro Declarations   */
#define HWREG8(_X)                      (*((volatile uint8_t*)(_x)))
#define SET_BIT(REG,BIT_POSN)           (REG |=(BIT_MASK<<BIT_POSN))  
#define CLEAR_BIT(REG,BIT_POSN)         (REG &=~(BIT_MASK<<BIT_POSN)) 
#define TOGGLE_BIT(REG,BIT_POSN)        (REG ^=(BIT_MASK<<BIT_POSN)) 
#define READ_BIT(REG,BIT_POSN)          ((REG >> BIT_POSN)&BIT_MASK);        
/*  Section : Data type Declarations */
typedef enum{
    GPIO_LOW=0,
    GPIO_HIGH        
}logic_t;
typedef enum{
    GPIO_DIRECTION_OUTPUT=0,
    GPIO_DIRECTION_INPUT        
}direction_t;
typedef enum{
    GPIO_PIN0 = 0,
    GPIO_PIN1,
    GPIO_PIN2,
    GPIO_PIN3,
    GPIO_PIN4,
    GPIO_PIN5,       
    GPIO_PIN6,
    GPIO_PIN7,       
}PIN_INDEX_t;
typedef enum{
    PORTA_INDEX =0,
    PORTB_INDEX,
    PORTC_INDE,
    PORTD_INDEX,
    PORTE_INDEX ,       
}port_index_t;


typedef struct{
    uint8 port:3;           /* @ref port_index_t */
    uint8 pin:3;            /* @ref PIN_INDEX_t */
    uint8 direction:1;      /* @ref direction_t */
    uint8 logic:1;          /* @ref logic_t */
    
}pin_config_t;

/*  Section : Function Declarations  */
Std_ReturnType gpio_pin_direction_initialize(const pin_config_t *_pin_config);
Std_ReturnType gpio_pin_git_direction_status(const pin_config_t *_pin_config,direction_t *direction_status);
Std_ReturnType gpio_pin_write_logic(const pin_config_t *_pin_config,logic_t logic);
Std_ReturnType gpio_pin_read_logic(const pin_config_t *_pin_config,logic_t *logic);
Std_ReturnType gpio_pin_toggel_logic(const pin_config_t *_pin_config);
Std_ReturnType gpio_pin_initialize(const pin_config_t *_pin_config);


Std_ReturnType gpio_port_direction_initialize(port_index_t port,uint8 direction);
Std_ReturnType gpio_port_git_direction_status(port_index_t port,uint8 *direction_status);
Std_ReturnType gpio_port_write_logic(port_index_t port,uint8 logic);
Std_ReturnType gpio_port_read_logic(port_index_t port ,uint8 *logic);
Std_ReturnType gpio_port_toggel_logic(port_index_t port);        
        
        
        

#endif	//GPIO_H */

